{
  "skillsData": {
    "1": {
      "pl": {
        "title": "Programming Languages",
        "skills": [["JavaScript",4],["Python",4],["Java",3],["Swift",2],["PHP",2],["C#",1]]
      },
      "ft": {
        "title": "Frameworks and Tools",
        "skills": [["Vue.js",4],["Redis",4],["TestComplete",4],["Selenium",4],["SwiftUI",3],["AWS",1]]
      }
    },
    "2": {
      "etc": {
        "title": "Related Skills",
        "skills": [["Technical Writing",4],["Automated Testing",4],["Project Management",3],["Team Leadership",3]]
      },
      "sl": {
        "title": "Spoken Languages",
        "skills": [["English",5],["German",4],["Japanese",3],["Spanish",1]]
      }
    }
  },
  "experienceData": {
    "software": {
      "CACI": {
        "name": "CACI",
        "extraName": "Space Operations",
        "location": "Santa Maria, CA / Remote",
        "technologies": ["JavaScript","Vue.js","Python","HTML/CSS","PHP","Java","Express","TestComplete","Selenium","Redis","SQL","Batch"],
        "roles": {
          "webswe": {
            "title": "Software Engineer, Full Stack",
            "dates": "(September 2021 - Present)",
            "desc": [
              "Assumed a lead role on a product at its MVP phase, managing its JIRA, tasking team members, and completely rebuilding the front end from scratch with multiple additional features, such as messaging, user authentication and registration, and hybrid vanilla+SVG rendering.",
              "Develop frontend and backend features and improvements for web applications using Vue.js, Node.js, and Redis.",
              "Create JavaScript processes to observe and transform data in Redis for consumption by other components.",
              "Optimize application performance by rewriting data structures, Vue components, data flows, and legacy code."
            ]
          },
          "automationswe": {
            "title": "Software Engineer, Automation",
            "dates": "(August 2020 - September 2021)",
            "desc": [
              "Supported team as acting lead during a period of transition between managers (January to July 2021).",
              "Fully automated the UI regression tests of our primary web application using Python, TestComplete, and Selenium.",
              "Created automation scripts for Windows applications and processes using Python and Batch scripting.",
              "Modernized the main UI of a Vue application in a team of three, handling the layout and all CSS styles."
            ]
          },
          "ste": {
            "title": "Software Test Automation Engineer",
            "dates": "(August 2019 - August 2020)",
            "desc": [
              "Promoted from Systems Analyst for prototyping our first automated regression tests, kickstarting a new team.",
              "Wrote automated UI and scenario tests using Python and Selenium.",
              "Evaluated off-the-shelf test automation frameworks, successfully presented a build-vs-buy case to senior management, and migrated over existing test functionality, reducing our project timeline by one year."
            ]
          },
          "satw": {
            "title": "Systems Analyst",
            "dates": "(July 2018 - August 2019)",
            "desc": [
              "Designed and developed a standalone Python tool with GUI controls to automate our Confluence document export process, reducing a four hour task to a single click.",
              "Wrote user guides and help system content, tested new builds, and submitted bug reports and improvements.",
              "Wrote multiple sections of our style guide (chiefly voice and tone) which are still used for all documentation."
            ]
          }
        }
      },
      "Boeing": {
        "name": "Boeing",
        "extraName": "(formerly Tapestry Solutions)",
        "location": "San Luis Obispo, CA",
        "technologies": null,
        "roles": {
          "st": {
            "title": "Software Application Tester",
            "dates": "(January 2017 - June 2018)",
            "desc": [
              "Tested web-based logistics applications, tracked requirements, and wrote test suites, test cases, and bug reports.",
              "Acted as lead tester and issue tracker for a major functional area of our application during a redesign from Flash to HTML5.",
              "Wrote reference docs, training material, and user guides for developers, testers, and customers."
            ]
          }
        }
      }
    },
    "localization": {
      "Aksys Games": {
        "name": "Aksys Games",
        "location": "Remote",
        "roles": {
          "editor": {
            "title": "Localization Editor",
            "dates": "(August 2022 - January 2023)",
            "desc": [
              "Worked closely with a translator to localize around half of a Nintendo Switch visual novel, amounting to over 400,000 Japanese characters."
            ]
          }
        }
      },
      "Kaiten Books": {
        "name": "Kaiten Books",
        "location": "Remote",
        "roles": {
          "editor": {
            "title": "Localization Editor",
            "dates": "(July 2022 - Present)",
            "desc": [
              "Edit translated comedy manga for digital and physical publication with a strong bias for puns and alliteration."
            ]
          }
        }
      },
      "J-Novel Club": {
        "name": "J-Novel Club",
        "location": "Remote",
        "roles": {
          "editor": {
            "title": "Localization Editor",
            "dates": "(July 2019 - Present)",
            "desc": [
              "Work closely with translators to produce localized novels and manga for digital and physical publication, modifying, rewriting, or retranslating content where appropriate.",
              "Promoted to editor as the top pick from the candidate pool of proofreaders."
            ]
          },
          "proofreader": {
            "title": "Proofreader",
            "dates": "(January 2019 - July 2019)",
            "desc": [
              "Proofread novels and manga from other translation teams on an as-needed basis."
            ]
          }
        }
      },
      "Mantra": {
        "name": "Mantra",
        "location": "Remote",
        "roles": {
          "editor": {
            "title": "Localization Editor & Backup Translator",
            "dates": "(August 2021 - Present)",
            "desc": [
              "Editing the 25 volume backlog of a Shogakukan manga series.",
              "Acting as backup translator for currently-releasing weekly chapters."
            ]
          }
        }
      },
      "FanTranslation": {
        "name": "Volunteering",
        "location": "Remote",
        "roles": {
          "tlpr": {
            "title": "Translator & Editor",
            "dates": "(April 2017 - December 2018)",
            "desc": [
              "Checked the accuracy of English translations by comparing them against their original texts, adjusting characterization and phrasing as needed.",
              "Translated Japanese to English and work with proofreaders to finalize content.",
              "Coordinated small teams on multiple projects simultaneously, mentoring other proofreaders and ESL team members."
            ]
          }
        }
      },
      "Ernst Law Group": {
        "name": "Ernst Law Group",
        "extraName": null,
        "location": "San Luis Obispo, CA",
        "technologies": null,
        "roles": {
          "interpreter": {
            "title": "Interpreter",
            "dates": "(September 2016)",
            "desc": [
              "Acted as a private interpreter for Ernst Law Group during depositions with German legal teams.",
              "Translated technical engineering and manufacturing documents in a high-speed environment."
            ]
          }
        }
      },
      "inXile Entertainment": {
        "name": "inXile Entertainment",
        "extraName": null,
        "location": "Newport Beach, CA",
        "technologies": null,
        "roles": {
          "localization editor": {
            "title": "Localization Editor",
            "dates": "(January 2014 - October 2014)",
            "desc": [
              "Proofread, edited, and/or translated over 36,000 lines of text from English to German.",
              "Moderated an online team of 20 volunteer translators and represented inXile Entertainment in mediating discussions within this group.",
              "Tested weekly software builds for localization issues and modified text mappings as needed."
            ]
          }
        }
      }
    }
  },
  "educationData": {
    "ucsb": {
      "name": "University of California, Santa Barbara",
      "location": "Santa Barbara, CA",
      "program": "Bachelor's in Linguistics",
      "extra": "concentrations in German and Japanese",
      "desc": "Studied the mixed bag of language, logic, psychology, respiratory anatomy, anthropology, and education theory that is linguistics.",
      "dates": "September 2013 - March 2016"
    },
    "icu": {
      "name": "International Christian University",
      "location": "Tokyo, Japan",
      "program": "UC Education Abroad Program ",
      "extra": "",
      "desc": "Took courses in Japanese political science, language policy, sociology, and culture. Completed an academic internship teaching English.",
      "dates": "August 2015 - November 2015"
    },
    "cuesta": {
      "name": "Cuesta College",
      "location": "San Luis Obispo, CA",
      "program": "Software Engineering",
      "extra": "",
      "desc": "Took the core computer science series and the AWS Developer Associate course. Studied Java, data structures and algorithms, and object oriented programming.",
      "dates": "Spring 2020 - Fall 2020"
    }
  }
}